Revit 2024 API
RevitAPIPreDocEventArgs Properties
The RevitAPIPreDocEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
Document
 The document associated with the event.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
See Also
RevitAPIPreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace